Repository: nathanfallet/ocaml
Catalog: Shared/*.lproj/Localizable.strings
Languages: de, fr, ja

# opensource_repo_js_of_ocaml
source: Compiler from OCaml to Javascript.
de: Compiler OCaml -> Javascript.
fr: Compilateur OCaml vers Javascript.
ja: OCamlからJavaScriptへのコンパイラー。

# button_cancel
source: Cancel
de: Abbrechen
fr: Annuler
ja: キャンセル

source: Documentation
ja: ドキュメント

source: Console
de: Konsole
ja: コンソール

# numberColor
source: Numbers color
de: Zahlen
fr: Couleur des nombres
ja: 数字の色

# plainColor
source: Plain text color
de: Text
fr: Couleur du texte
ja: プレーンテキストの色

source: Open source
ja: オープンソース

# keywordColor
source: Keywords color
de: Schlüsselwörter
fr: Couleur des mots clés
ja: キーワードの色

# donate_header
source: Select an amount to donate:
de: Wählen Sie einen Spendenbetrag:
fr: Sélectionnez le montant à donner :
ja: 寄付する金額を選んでください:

# donate_title
source: Donate
de: Spenden
fr: Faire un don
ja: 寄付する

# opensource_repo_DonateViewController
source: A view controller to make donations.
de: Ein View-Controller für Spenden.
fr: Une vue pour faire des dons.
ja: 寄付のためのビューコントローラー。

# opensource_repo_Kingfisher
source: A lightweight, pure-Swift library for downloading and caching images from the web.
de: Swift Bibliothek zum Downloaden und Zwischenspeichern von Bildern aus dem Web.
fr: Une bibliothèque Swift légère pour télécharger et cacher des images.
ja: Webから画像をダウンロード・キャッシュするための軽量かつ純Swift製ライブラリ。

source: Editor settings
de: Editor
fr: Paramètres de l'éditeur
ja: エディターの設定

# developer_text
source: Developed by Nathan Fallet
de: Entwickelt von Nathan Fallet
fr: Développé par Nathan Fallet
ja: 制作: Nathan Fallet

source: Background color
de: Hintergrund
fr: Couleur d'arrière plan
ja: 背景色

# donate_footer
source: This donation will help our organization to develop its projects, mainly Extopy, the social network we are working on, which will require some storage for its servers.
de: Ihre Spende wird zur Entwicklung unserer Organisation genutzt, hauptsächlich zum Erhalt der Server von Extopy, einem von uns entwickelten sozialen Netzwerk.
fr: Ce don va aider notre association à développer ses projets, notamment Extopy, le réseau social que nous développons, qui va nécessiter principalement du stockage sur ses serveurs.
ja: この寄付は当組織にとってプロジェクト開発の支援につながります、とりわけ私たちが取り組んでいるソーシャルネットワークExtopyはサーバーにストレージを必要とします。

source: About
de: Über
fr: A propos
ja: Appについて

# console_load
source: Loading OCaml console, please waitâ€¦
de: OCaml Konsole wird geladen, bitte warten…
fr: Chargement de la console OCaml, veuillez patienter…
ja: OCamlコンソールを読み込んでいます、お待ちください…

# opensource_repo_DigiAnalytics
source: Realtime web analytics with privacy and simplicity at its core.
de: Echtzeitwebanalyse mit Fokus auf Datenschutz und Simplizität.
fr: Analytique web en temps réel avec confidentialité et simplicité.
ja: プライバシーと簡潔さを核心に持つリアルタイムWebアナリティクス。

source: Learn
de: Lernen
fr: Apprendre
ja: 学ぶ

# identifierColor
source: Identifiers color
de: Variablennamen
fr: Couleur des identifiants
ja: 識別子の色

# button_reset
source: Reset
de: Zurücksetzen
fr: Réinitialiser
ja: リセット

# opensource_repo_Sourceful
source: A syntax highlighting source editor for iOS and macOS using UITextView and NSTextView.
de: Ein Code-Editor mit Syntaxhervorhebung für iOS und macOS, verwendet UITextView und NSTextView.
fr: Un éditeur avec coloration syntaxique pour iOS et macOS avec UITextView et NSTextView.
ja: UITextViewとNSTextViewを使用したiOSおよびmaxOS向けのシンタックスハイライト付きソースエディター。

# stringColor
source: Strings color
de: Zeichenketten
fr: Couleur des chaines de caractères
ja: 文字列の色

# commentColor
source: Comments color
de: Kommentare
fr: Couleur des commentaires
ja: コメントの色

source: Settings
de: Einstellungen
fr: Paramètres
ja: 設定

# opensource_others
source: Others
de: Andere
fr: Autres
ja: その他

source: Code
fr: Coder
ja: コード

# donate_thanks
source: Thanks for donating to our organization!
de: Vielen Dank für Ihre Spende!
fr: Merci du don pour notre association !
ja: 当組織への寄付ありがとうございます！

# opensource_repo_OCaml
source: The app itself
de: Diese Applikation.
fr: L'app elle-même
ja: App本体

# console_failed
source: Failed to load console
de: Fehler beim Laden der Konsole
fr: Erreur lors du chargement de la console
ja: コンソールの読み込みに失敗しました

# opensource_swiftpackages
source: Swift packages
de: Swift Pakete
ja: Swiftパッケージ
